# SetVPClassVisibility

## Description
Sets the visibility for the specified class in the specified viewport.

```pascal
FUNCTION SetVPClassVisibility(
				viewportHandle : HANDLE;
				className      : STRING;
				visibilityType : INTEGER) : BOOLEAN;
```

```python

def vs.SetVPClassVisibility(viewportHandle, className, visibilityType):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE||
|className|STRING||
|visibilityType|INTEGER||

## Version
Availability: from VectorWorks11.0
## Category
* Objects - Groups